Revit 2027 API
SteelElementProperties.GetReference Method
 This method will return the reference for the given fabrication id.
Namespace: Autodesk.Revit.DB.Steel
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Reference GetReference(
	Document aDoc,
	Guid guid
)
Public Shared Function GetReference (
	aDoc As Document,
	guid As Guid
) As Reference
public:
static Reference^ GetReference(
	Document^ aDoc,
	Guid guid
)
static member GetReference :
        aDoc : Document *
        guid : Guid -> Reference
Parameters
aDoc Document
 Document in which to search for the reference.
guid Guid
 The fabrication id for which a reference is required.
Return Value
Reference
 The reference to the element or subelement corresponding to the given id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace